<a href="https://colab.research.google.com/github/project-mlx/coding-Machine-Learning/blob/main/kaggle_Titanic_problem_ML_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Solivng the Kaggle's titanic problem using Machine Learning**

The datasets desciption is available on https://www.kaggle.com/c/titanic/data


Import required libraries

In [73]:
import pandas as pd
import numpy as np

Read datasets

In [74]:
url = "http://s3.amazonaws.com/assets.datacamp.com/course/Kaggle/train.csv"
df = pd.read_csv(url)

View the values inside the dataset

In [75]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Picking relevant columns (this step is much more complex, however, we will directly pick the features for understand ML process)

In [76]:
include = ['Age', 'Sex', 'Embarked', 'Survived']
df = df[include]
df.head()

    Age     Sex Embarked  Survived
0  22.0    male        S         0
1  38.0  female        C         1
2  26.0  female        S         1
3  35.0  female        S         1
4  35.0    male        S         0

Selecting Categorical columns and dealing with null values on Numerical columns by replacing them with the mean of the column.

In [77]:
categoricals = []

for col, col_type in dfN.dtypes.iteritems():
     if col_type == 'O':
          categoricals.append(col)
     else:
          df[col].fillna(df[col].mean(), inplace=True)

In [78]:
categoricals

['Sex', 'Embarked']


We will now create features out of the categorical columns using pandas.get_dummies (feature engineering topics will be covered in later posts)

In [79]:
df = pd.get_dummies(df, columns=categoricals, dummy_na=True)

In [80]:
df.head()

    Age  Survived  Sex_female  ...  Embarked_Q  Embarked_S  Embarked_nan
0  22.0         0           0  ...           0           1             0
1  38.0         1           1  ...           0           0             0
2  26.0         1           1  ...           0           1             0
3  35.0         1           1  ...           0           1             0
4  35.0         0           0  ...           0           1             0

[5 rows x 9 columns]

Building a simple Logistic regression model

In [81]:
from sklearn.linear_model import LogisticRegression #importing algorithm

prediction_class = 'Survived' #the class column's name (the column that we have to predict)
x = df[df.columns.difference([prediction_class])] #selecting all the columns except the class column
y = df[prediction_class] #selecting the class column

lr = LogisticRegression() #creating an object of the LR algorithm
lr.fit(x, y) #Training the algorithm with the data features and labels

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

Model evaluation

In [82]:
lr.score(x,y)

0.7867564534231201

Model is 78% aligned

Testing the model

Now we will check whether the person with certain charecteristics will survive.

In [86]:
test_input = {'Age':29,
              'Sex':'male',
              'Embarked':'C'}

In [87]:
model_columns = list(x.columns)

In [88]:
input = pd.get_dummies(pd.DataFrame(test_input, index=[0]))
input = input.reindex(columns=model_columns, fill_value=0)

prediction = lr.predict(input)

In [89]:
if prediction[0] == 0:
  print('The person survived')
else:
  print('The person died')

The person survived

Note: since the test data provided by Kaggle doesn't contain the labels(actual class), we can't perform real assesments on the model. However, this experiment was just to make you understand the process and steps of Machine Learning.